# NLS_MESSAGEFORMAT_NONE
# NLS_ENCODING=UTF-8
ExtName=[G'(\uff25\uff58\uff50\uff45\uff52\uff49\uff4d\uff45\uff4e\uff54al) IBM DevOps Control\u0e0f\u0e39\u0130\u0131\uff5c]
ExtDesc=[G'\uff2c\uff45\uff56\uff45\uff52\uff41\uff47\uff45\uff53 \uff29\uff22\uff2d \uff24\uff45\uff56\uff2f\uff50\uff53 \uff23\uff4f\uff4e\uff54\uff52\uff4f\uff4c \uff54\uff4f \uff50\uff52\uff4f\uff56\uff49\uff44\uff45 \uff52\uff45\uff44-\uff42\uff4c\uff41\uff43\uff4b \uff5a\uff45\uff52\uff4f \uff44\uff4fwntime deployments to IBM Container Service on Bluemix, Cloud Foundry on IBM Bluemix, IBM Virtual Infrastructure Services on Bluemix.\u0e0f\u0e39\u0130\u0131\uff5c]
ExtMessage=[G'\uff26\uff4f\uff52 \uff49\uff4e\uff46\uff4f\uff52\uff4d\uff41\uff54\uff49\uff4f\uff4e on leveraging this extension refer to the following <a href="https://developer.ibm.com/bluemix/2015/04/28/red-black-deployment-ibm-devops-services">tutorial</a>.\u0e0f\u0e39\u0130\u0131\uff5c]

# target platform 
TARGET_PLATFORM_KEY=[G'\uff34\uff41\uff52\uff47et Platform\u0e0f\u0e39\u0130\u0131\uff5c]
TARGET_PLATFORM_DESC=[G'\uff34\uff48\uff45 \uff22\uff4c\uff55\uff45\uff4d\uff49\uff58 \uff30\uff4c\uff41\uff54\uff46\uff4f\uff52\uff4d \uff42\uff45\uff49\uff4eg deployed to.  This can be 'Containers', 'Virtual Machines' or 'CloudFoundry'.\u0e0f\u0e39\u0130\u0131\uff5c]
# rampup time 
RAMPUP_TIME_KEY=[G'\uff32\uff41mpup Time\u0e0f\u0e39\u0130\u0131\uff5c]
RAMPUP_TIME_DESC=[G'\uff34\uff48\uff45 \uff41\uff50\uff50\uff52\uff4f\uff58\uff49\uff4d\uff41\uff54\uff45 \uff44\uff55\uff52\uff41\uff54\uff49\uff4f\uff4e \uff54\uff48\uff41\uff54 \uff49\uff4estances of the new version will be ramped up till they receive fifty percent of the traffic. \u0e0f\u0e39\u0130\u0131\uff5c]
# cold standby time 
STANDBY_TIME_KEY=[G'\uff33\uff54\uff41\uff4e\uff44\uff42\uff59 \uff34ime (minutes)\u0e0f\u0e39\u0130\u0131\uff5c]
STANDBY_TIME_DESC=[G'\uff34\uff48\uff45 \uff44\uff55\uff52\uff41\uff54\uff49\uff4f\uff4e \uff4f\uff46 \uff54\uff49\uff4d\uff45 \uff54\uff48\uff41\uff54 \uff54\uff48\uff45 \uff50\uff52\uff45\uff56\uff49\uff4f\uff55\uff53 version will be kept on cold standby to facilitate a rollback to the previous version if necessary. \u0e0f\u0e39\u0130\u0131\uff5c]
# rampdown time 
RAMPDOWN_TIME_KEY=[G'\uff32\uff41\uff4d\uff50\uff44\uff4f\uff57\uff4e Time (minutes)\u0e0f\u0e39\u0130\u0131\uff5c]
RAMPDOWN_TIME_DESC=[G'\uff34\uff48\uff45 \uff41\uff50\uff50\uff52\uff4f\uff58\uff49\uff4d\uff41\uff54\uff45 \uff44\uff55\uff52\uff41\uff54\uff49\uff4f\uff4e \uff54hat previous versions of the application will be removed after the 'Standby Time'.\u0e0f\u0e39\u0130\u0131\uff5c]